Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcrad_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/mcan.h
/* -------- MCAN_TXEFS : (MCAN Offset: 0xF4) (R/  32) Transmit Event FIFO Status Register -------- */
#define MCAN_TXEFS_EFFL_Pos                   (0U)                                           /**< (MCAN_TXEFS) Event FIFO Fill Level Position */
#define MCAN_TXEFS_EFFL_Msk                   (0x3FU << MCAN_TXEFS_EFFL_Pos)                 /**< (MCAN_TXEFS) Event FIFO Fill Level Mask */
#define MCAN_TXEFS_EFFL(value)                (MCAN_TXEFS_EFFL_Msk & ((value) << MCAN_TXEFS_EFFL_Pos))
#define MCAN_TXEFS_EFGI_Pos                   (8U)                                           /**< (MCAN_TXEFS) Event FIFO Get Index Position */
#define MCAN_TXEFS_EFGI_Msk                   (0x1FU << MCAN_TXEFS_EFGI_Pos)                 /**< (MCAN_TXEFS) Event FIFO Get Index Mask */
#define MCAN_TXEFS_EFGI(value)                (MCAN_TXEFS_EFGI_Msk & ((value) << MCAN_TXEFS_EFGI_Pos))
#define MCAN_TXEFS_EFPI_Pos                   (16U)                                          /**< (MCAN_TXEFS) Event FIFO Put Index Position */
#define MCAN_TXEFS_EFPI_Msk                   (0x1FU << MCAN_TXEFS_EFPI_Pos)                 /**< (MCAN_TXEFS) Event FIFO Put Index Mask */
#define MCAN_TXEFS_EFPI(value)                (MCAN_TXEFS_EFPI_Msk & ((value) << MCAN_TXEFS_EFPI_Pos))
#define MCAN_TXEFS_EFF_Pos                    (24U)                                          /**< (MCAN_TXEFS) Event FIFO Full Position */
#define MCAN_TXEFS_EFF_Msk                    (0x1U << MCAN_TXEFS_EFF_Pos)                   /**< (MCAN_TXEFS) Event FIFO Full Mask */
#define MCAN_TXEFS_EFF(value)                 (MCAN_TXEFS_EFF_Msk & ((value) << MCAN_TXEFS_EFF_Pos))
#define MCAN_TXEFS_TEFL_Pos                   (25U)                                          /**< (MCAN_TXEFS) Tx Event FIFO Element Lost Position */
#define MCAN_TXEFS_TEFL_Msk                   (0x1U << MCAN_TXEFS_TEFL_Pos)                  /**< (MCAN_TXEFS) Tx Event FIFO Element Lost Mask */
#define MCAN_TXEFS_TEFL(value)                (MCAN_TXEFS_TEFL_Msk & ((value) << MCAN_TXEFS_TEFL_Pos))
#define MCAN_TXEFS_Msk                        (0x031F1F3FUL)                                 /**< (MCAN_TXEFS) Register Mask  */

/* -------- MCAN_TXEFA : (MCAN Offset: 0xF8) (R/W 32) Transmit Event FIFO Acknowledge Register -------- */
#define MCAN_TXEFA_EFAI_Pos                   (0U)                                           /**< (MCAN_TXEFA) Event FIFO Acknowledge Index Position */
#define MCAN_TXEFA_EFAI_Msk                   (0x1FU << MCAN_TXEFA_EFAI_Pos)                 /**< (MCAN_TXEFA) Event FIFO Acknowledge Index Mask */
#define MCAN_TXEFA_EFAI(value)                (MCAN_TXEFA_EFAI_Msk & ((value) << MCAN_TXEFA_EFAI_Pos))
#define MCAN_TXEFA_Msk                        (0x0000001FUL)                                 /**< (MCAN_TXEFA) Register Mask  */

/** \brief MCAN register offsets definitions */
#define MCAN_CREL_OFFSET               (0x00)         /**< (MCAN_CREL) Core Release Register Offset */
#define MCAN_ENDN_OFFSET               (0x04)         /**< (MCAN_ENDN) Endian Register Offset */
#define MCAN_CUST_OFFSET               (0x08)         /**< (MCAN_CUST) Customer Register Offset */
#define MCAN_DBTP_OFFSET               (0x0C)         /**< (MCAN_DBTP) Data Bit Timing and Prescaler Register Offset */
#define MCAN_TEST_OFFSET               (0x10)         /**< (MCAN_TEST) Test Register Offset */
#define MCAN_RWD_OFFSET                (0x14)         /**< (MCAN_RWD) RAM Watchdog Register Offset */
#define MCAN_CCCR_OFFSET               (0x18)         /**< (MCAN_CCCR) CC Control Register Offset */
#define MCAN_NBTP_OFFSET               (0x1C)         /**< (MCAN_NBTP) Nominal Bit Timing and Prescaler Register Offset */
#define MCAN_TSCC_OFFSET               (0x20)         /**< (MCAN_TSCC) Timestamp Counter Configuration Register Offset */
#define MCAN_TSCV_OFFSET               (0x24)         /**< (MCAN_TSCV) Timestamp Counter Value Register Offset */
#define MCAN_TOCC_OFFSET               (0x28)         /**< (MCAN_TOCC) Timeout Counter Configuration Register Offset */
#define MCAN_TOCV_OFFSET               (0x2C)         /**< (MCAN_TOCV) Timeout Counter Value Register Offset */
#define MCAN_ECR_OFFSET                (0x40)         /**< (MCAN_ECR) Error Counter Register Offset */
#define MCAN_PSR_OFFSET                (0x44)         /**< (MCAN_PSR) Protocol Status Register Offset */
#define MCAN_TDCR_OFFSET               (0x48)         /**< (MCAN_TDCR) Transmit Delay Compensation Register Offset */
#define MCAN_IR_OFFSET                 (0x50)         /**< (MCAN_IR) Interrupt Register Offset */
#define MCAN_IE_OFFSET                 (0x54)         /**< (MCAN_IE) Interrupt Enable Register Offset */
#define MCAN_ILS_OFFSET                (0x58)         /**< (MCAN_ILS) Interrupt Line Select Register Offset */
#define MCAN_ILE_OFFSET                (0x5C)         /**< (MCAN_ILE) Interrupt Line Enable Register Offset */
#define MCAN_GFC_OFFSET                (0x80)         /**< (MCAN_GFC) Global Filter Configuration Register Offset */
#define MCAN_SIDFC_OFFSET              (0x84)         /**< (MCAN_SIDFC) Standard ID Filter Configuration Register Offset */
#define MCAN_XIDFC_OFFSET              (0x88)         /**< (MCAN_XIDFC) Extended ID Filter Configuration Register Offset */
#define MCAN_XIDAM_OFFSET              (0x90)         /**< (MCAN_XIDAM) Extended ID AND Mask Register Offset */
#define MCAN_HPMS_OFFSET               (0x94)         /**< (MCAN_HPMS) High Priority Message Status Register Offset */
#define MCAN_NDAT1_OFFSET              (0x98)         /**< (MCAN_NDAT1) New Data 1 Register Offset */
#define MCAN_NDAT2_OFFSET              (0x9C)         /**< (MCAN_NDAT2) New Data 2 Register Offset */
#define MCAN_RXF0C_OFFSET              (0xA0)         /**< (MCAN_RXF0C) Receive FIFO 0 Configuration Register Offset */
#define MCAN_RXF0S_OFFSET              (0xA4)         /**< (MCAN_RXF0S) Receive FIFO 0 Status Register Offset */
#define MCAN_RXF0A_OFFSET              (0xA8)         /**< (MCAN_RXF0A) Receive FIFO 0 Acknowledge Register Offset */
#define MCAN_RXBC_OFFSET               (0xAC)         /**< (MCAN_RXBC) Receive Rx Buffer Configuration Register Offset */
#define MCAN_RXF1C_OFFSET              (0xB0)         /**< (MCAN_RXF1C) Receive FIFO 1 Configuration Register Offset */
#define MCAN_RXF1S_OFFSET              (0xB4)         /**< (MCAN_RXF1S) Receive FIFO 1 Status Register Offset */
#define MCAN_RXF1A_OFFSET              (0xB8)         /**< (MCAN_RXF1A) Receive FIFO 1 Acknowledge Register Offset */
#define MCAN_RXESC_OFFSET              (0xBC)         /**< (MCAN_RXESC) Receive Buffer / FIFO Element Size Configuration Register Offset */
#define MCAN_TXBC_OFFSET               (0xC0)         /**< (MCAN_TXBC) Transmit Buffer Configuration Register Offset */
#define MCAN_TXFQS_OFFSET              (0xC4)         /**< (MCAN_TXFQS) Transmit FIFO/Queue Status Register Offset */
#define MCAN_TXESC_OFFSET              (0xC8)         /**< (MCAN_TXESC) Transmit Buffer Element Size Configuration Register Offset */
#define MCAN_TXBRP_OFFSET              (0xCC)         /**< (MCAN_TXBRP) Transmit Buffer Request Pending Register Offset */
#define MCAN_TXBAR_OFFSET              (0xD0)         /**< (MCAN_TXBAR) Transmit Buffer Add Request Register Offset */
#define MCAN_TXBCR_OFFSET              (0xD4)         /**< (MCAN_TXBCR) Transmit Buffer Cancellation Request Register Offset */
#define MCAN_TXBTO_OFFSET              (0xD8)         /**< (MCAN_TXBTO) Transmit Buffer Transmission Occurred Register Offset */
#define MCAN_TXBCF_OFFSET              (0xDC)         /**< (MCAN_TXBCF) Transmit Buffer Cancellation Finished Register Offset */
#define MCAN_TXBTIE_OFFSET             (0xE0)         /**< (MCAN_TXBTIE) Transmit Buffer Transmission Interrupt Enable Register Offset */
#define MCAN_TXBCIE_OFFSET             (0xE4)         /**< (MCAN_TXBCIE) Transmit Buffer Cancellation Finished Interrupt Enable Register Offset */
#define MCAN_TXEFC_OFFSET              (0xF0)         /**< (MCAN_TXEFC) Transmit Event FIFO Configuration Register Offset */
#define MCAN_TXEFS_OFFSET              (0xF4)         /**< (MCAN_TXEFS) Transmit Event FIFO Status Register Offset */
#define MCAN_TXEFA_OFFSET              (0xF8)         /**< (MCAN_TXEFA) Transmit Event FIFO Acknowledge Register Offset */

/** \brief MCAN register API structure */
typedef struct
{
  __I   uint32_t                       MCAN_CREL;       /**< Offset: 0x00 (R/   32) Core Release Register */
  __I   uint32_t                       MCAN_ENDN;       /**< Offset: 0x04 (R/   32) Endian Register */
  __IO  uint32_t                       MCAN_CUST;       /**< Offset: 0x08 (R/W  32) Customer Register */
  __IO  uint32_t                       MCAN_DBTP;       /**< Offset: 0x0c (R/W  32) Data Bit Timing and Prescaler Register */
  __IO  uint32_t                       MCAN_TEST;       /**< Offset: 0x10 (R/W  32) Test Register */
  __IO  uint32_t                       MCAN_RWD;        /**< Offset: 0x14 (R/W  32) RAM Watchdog Register */
  __IO  uint32_t                       MCAN_CCCR;       /**< Offset: 0x18 (R/W  32) CC Control Register */
  __IO  uint32_t                       MCAN_NBTP;       /**< Offset: 0x1c (R/W  32) Nominal Bit Timing and Prescaler Register */
  __IO  uint32_t                       MCAN_TSCC;       /**< Offset: 0x20 (R/W  32) Timestamp Counter Configuration Register */
  __IO  uint32_t                       MCAN_TSCV;       /**< Offset: 0x24 (R/W  32) Timestamp Counter Value Register */
  __IO  uint32_t                       MCAN_TOCC;       /**< Offset: 0x28 (R/W  32) Timeout Counter Configuration Register */
  __IO  uint32_t                       MCAN_TOCV;       /**< Offset: 0x2c (R/W  32) Timeout Counter Value Register */
  __I   uint8_t                        Reserved1[0x10];
  __I   uint32_t                       MCAN_ECR;        /**< Offset: 0x40 (R/   32) Error Counter Register */
  __I   uint32_t                       MCAN_PSR;        /**< Offset: 0x44 (R/   32) Protocol Status Register */
  __IO  uint32_t                       MCAN_TDCR;       /**< Offset: 0x48 (R/W  32) Transmit Delay Compensation Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       MCAN_IR;         /**< Offset: 0x50 (R/W  32) Interrupt Register */
  __IO  uint32_t                       MCAN_IE;         /**< Offset: 0x54 (R/W  32) Interrupt Enable Register */
  __IO  uint32_t                       MCAN_ILS;        /**< Offset: 0x58 (R/W  32) Interrupt Line Select Register */
  __IO  uint32_t                       MCAN_ILE;        /**< Offset: 0x5c (R/W  32) Interrupt Line Enable Register */
  __I   uint8_t                        Reserved3[0x20];
  __IO  uint32_t                       MCAN_GFC;        /**< Offset: 0x80 (R/W  32) Global Filter Configuration Register */
  __IO  uint32_t                       MCAN_SIDFC;      /**< Offset: 0x84 (R/W  32) Standard ID Filter Configuration Register */
  __IO  uint32_t                       MCAN_XIDFC;      /**< Offset: 0x88 (R/W  32) Extended ID Filter Configuration Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       MCAN_XIDAM;      /**< Offset: 0x90 (R/W  32) Extended ID AND Mask Register */
  __I   uint32_t                       MCAN_HPMS;       /**< Offset: 0x94 (R/   32) High Priority Message Status Register */
  __IO  uint32_t                       MCAN_NDAT1;      /**< Offset: 0x98 (R/W  32) New Data 1 Register */
  __IO  uint32_t                       MCAN_NDAT2;      /**< Offset: 0x9c (R/W  32) New Data 2 Register */
  __IO  uint32_t                       MCAN_RXF0C;      /**< Offset: 0xa0 (R/W  32) Receive FIFO 0 Configuration Register */
  __I   uint32_t                       MCAN_RXF0S;      /**< Offset: 0xa4 (R/   32) Receive FIFO 0 Status Register */
  __IO  uint32_t                       MCAN_RXF0A;      /**< Offset: 0xa8 (R/W  32) Receive FIFO 0 Acknowledge Register */
  __IO  uint32_t                       MCAN_RXBC;       /**< Offset: 0xac (R/W  32) Receive Rx Buffer Configuration Register */
  __IO  uint32_t                       MCAN_RXF1C;      /**< Offset: 0xb0 (R/W  32) Receive FIFO 1 Configuration Register */
  __I   uint32_t                       MCAN_RXF1S;      /**< Offset: 0xb4 (R/   32) Receive FIFO 1 Status Register */
  __IO  uint32_t                       MCAN_RXF1A;      /**< Offset: 0xb8 (R/W  32) Receive FIFO 1 Acknowledge Register */
  __IO  uint32_t                       MCAN_RXESC;      /**< Offset: 0xbc (R/W  32) Receive Buffer / FIFO Element Size Configuration Register */
  __IO  uint32_t                       MCAN_TXBC;       /**< Offset: 0xc0 (R/W  32) Transmit Buffer Configuration Register */
  __I   uint32_t                       MCAN_TXFQS;      /**< Offset: 0xc4 (R/   32) Transmit FIFO/Queue Status Register */
  __IO  uint32_t                       MCAN_TXESC;      /**< Offset: 0xc8 (R/W  32) Transmit Buffer Element Size Configuration Register */
  __I   uint32_t                       MCAN_TXBRP;      /**< Offset: 0xcc (R/   32) Transmit Buffer Request Pending Register */
  __IO  uint32_t                       MCAN_TXBAR;      /**< Offset: 0xd0 (R/W  32) Transmit Buffer Add Request Register */
  __IO  uint32_t                       MCAN_TXBCR;      /**< Offset: 0xd4 (R/W  32) Transmit Buffer Cancellation Request Register */
  __I   uint32_t                       MCAN_TXBTO;      /**< Offset: 0xd8 (R/   32) Transmit Buffer Transmission Occurred Register */
  __I   uint32_t                       MCAN_TXBCF;      /**< Offset: 0xdc (R/   32) Transmit Buffer Cancellation Finished Register */
  __IO  uint32_t                       MCAN_TXBTIE;     /**< Offset: 0xe0 (R/W  32) Transmit Buffer Transmission Interrupt Enable Register */
  __IO  uint32_t                       MCAN_TXBCIE;     /**< Offset: 0xe4 (R/W  32) Transmit Buffer Cancellation Finished Interrupt Enable Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       MCAN_TXEFC;      /**< Offset: 0xf0 (R/W  32) Transmit Event FIFO Configuration Register */
  __I   uint32_t                       MCAN_TXEFS;      /**< Offset: 0xf4 (R/   32) Transmit Event FIFO Status Register */
  __IO  uint32_t                       MCAN_TXEFA;      /**< Offset: 0xf8 (R/W  32) Transmit Event FIFO Acknowledge Register */
} mcan_registers_t;
/** @}  end of Controller Area Network */

#endif /* SAME_SAME70_MCAN_MODULE_H */

